In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

In [2]:
import getpass

In [3]:
password = getpass.getpass()

engine = create_engine('mysql+pymysql://root:'+password+'@localhost/bank')

In [4]:
def df(q):
    if q[:6].lower()=='select':
        data=pd.read_sql_query(q, engine)
    else:
        data=pd.read_sql_query('select '+q, engine)                    
    return data

def exe(q):
    engine.execute(q)

Instructions
Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

How many distinct (different) actors' last names are there?
Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
Get all films with ARMAGEDDON in the title.
Get 10 the longest films.
How many films include Behind the Scenes content?
Which kind of movies (rating) have a mean duration of more than two hours?
Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [5]:
exe('Use sakila')

How many distinct (different) actors' last names are there?

In [6]:
df('Select count(distinct last_name) as last_names from sakila.actor')['last_names'][0]

121

Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [14]:
df('select rental_date, case when weekday(rental_date) > 4 then "weekend" else "workday" end as day_type from rental')

              rental_date day_type
0     2005-05-24 22:53:30  workday
1     2005-05-24 22:54:33  workday
2     2005-05-24 23:03:39  workday
3     2005-05-24 23:04:41  workday
4     2005-05-24 23:05:21  workday
...                   ...      ...
16039 2006-02-14 15:16:03  workday
16040 2006-02-14 15:16:03  workday
16041 2006-02-14 15:16:03  workday
16042 2006-02-14 15:16:03  workday
16043 2006-02-14 15:16:03  workday

[16044 rows x 2 columns]

Get all films with ARMAGEDDON in the title.

In [9]:
df("select title from film where title like '%%ARMAGEDDON%%'")

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

Get 10 the longest films.

In [10]:
df('select title, length from film order by length limit 10')

                 title  length
0  RIDGEMONT SUBMARINE      46
1            IRON MOON      46
2         ALIEN CENTER      46
3     LABYRINTH LEAGUE      46
4        KWAI HOMEWARD      46
5      DOWNHILL ENOUGH      47
6       HALLOWEEN NUTS      47
7       HANOVER GALAXY      47
8      DIVORCE SHINING      47
9           HAWK CHILL      47

How many films include Behind the Scenes content?

In [11]:
df('select count(*) as c from film where special_features like "%%behind the scenes%%"')['c'][0]

538

Which kind of movies (rating) have a mean duration of more than two hours?

In [12]:
df('''select c.name as Category, avg(f.length) as Mean_Duration from category c 
join film_category fc 
on c.category_ID=fc.category_ID 
join film f
on fc.film_id=f.film_id
group by category
having Mean_Duration > 120''')

  Category  Mean_Duration
0    Drama       120.8387
1  Foreign       121.6986
2    Games       127.8361
3   Sports       128.2027

Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [13]:
df('Title, Length, rank() over (order by length) as "Rank" from film where length > 0')

                   Title  Length  Rank
0           ALIEN CENTER      46     1
1              IRON MOON      46     1
2          KWAI HOMEWARD      46     1
3       LABYRINTH LEAGUE      46     1
4    RIDGEMONT SUBMARINE      46     1
..                   ...     ...   ...
995        MUSCLE BRIGHT     185   991
996         POND SEATTLE     185   991
997   SOLDIERS EVOLUTION     185   991
998    SWEET BROTHERHOOD     185   991
999         WORST BANGER     185   991

[1000 rows x 3 columns]